Rails/space/app/views/aliens/_form.html.erb

    <%= form.label :planet %><br>
    <%= collection_select(:alien, :planet_id, Planet.all, :id, :name) %>
---
SELECT "planets".* FROM "planets"

    <%= form.label :powers %><br>
    <%= collection_check_boxes(:alien, :power_ids, Power.all, :id, :name) %>
---
SELECT "powers".* FROM "powers"